{
  "backend/main.mo": "Motoko actor defining an Inquiry type and managing travel inquiries with submitInquiry (creates new inquiry with timestamp), getAllInquiries (returns sorted by timestamp), and getInquiry (fetches by ID) functions using a Map store.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: live chat widget, SEO optimization, country-specific destination images, USD to INR currency conversion, and company name updates to \"Leisureflies Travels Pvt Ltd\".",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, utilities, and data files for the Leisureflies travel website with SEO, chat, inquiry forms, and INR pricing.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes, defining warm travel-themed palette (sunset oranges, sandy beiges, ocean teals) and custom design tokens.",
  "frontend/index.html": "HTML entry point with page title \"Leisureflies Travels Pvt Ltd - Your Journey Begins Here\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for Home, Destinations, Packages, About, Contact, and admin Inquiries pages, all wrapped in SiteLayout.",
  "frontend/src/components/chat/ChatWidget.tsx": "Floating chat widget with expandable panel, message display, input field, auto-reply simulation, and sessionStorage persistence using useChatState hook.",
  "frontend/src/components/inquiry/InquiryForm.tsx": "Travel inquiry form with react-hook-form validation collecting customer details (name, email, phone, dates, destination, travelers, budget, message), submitting via useSubmitInquiry mutation, and displaying success/error states.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout component providing sticky header with logo and navigation, mobile menu sheet, main content outlet, and footer with company info and links.",
  "frontend/src/components/seo/SEOHead.tsx": "SEO component that dynamically sets document title, meta tags (description, keywords), Open Graph tags, Twitter Card tags, and canonical URL using useEffect.",
  "frontend/src/components/seo/StructuredData.tsx": "Injects JSON-LD structured data for TravelAgency schema with company details, addresses, contact points, and ratings into the document head.",
  "frontend/src/data/company.ts": "Exports company profile data including legal name, founding details, certifications, services, values, and office locations for Leisureflies Travels.",
  "frontend/src/data/contact.ts": "Exports contact information including corporate and branch office addresses, department-specific phone numbers, email, and website.",
  "frontend/src/data/destinations.ts": "Defines destination data structure and exports array of six travel destinations (Dubai, Greece, France, Switzerland, Maldives, Thailand) with descriptions, images, prices, and highlights.",
  "frontend/src/data/packages.ts": "Defines travel package data structure and exports array of six vacation packages with durations, descriptions, highlights, price ranges, and destination associations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useChatState.ts": "Custom hook managing chat widget state (open/closed) and messages with sessionStorage persistence for chat history across page navigation.",
  "frontend/src/hooks/useInquiries.ts": "React Query hook that fetches all inquiries from the backend actor and returns them sorted by timestamp in descending order.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/hooks/useSubmitInquiry.ts": "React Query mutation hook for submitting travel inquiries to the backend actor, handling form data and invalidating the inquiries cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm travel-themed color palette (sunset oranges, sandy beiges, ocean teals) for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying company profile, founding story, certifications (IATA, TAAI), core values, and milestones with SEO metadata for Leisureflies travel agency.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing corporate and branch office details with an inquiry form that can be pre-filled with destination/package from URL search params.",
  "frontend/src/pages/DestinationsPage.tsx": "Destinations listing page displaying travel destination cards with images, highlights, pricing, and inquiry buttons that navigate to contact page with pre-filled destination.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component with hero section, features grid (curated destinations, expert guidance, trusted/secure, award winning), and SEO metadata including structured data for the Leisureflies travel company.",
  "frontend/src/pages/InquiriesAdminPage.tsx": "Admin dashboard page for viewing and managing customer travel inquiries with summary cards (total inquiries, weekly count, average travelers) and a detailed table displaying inquiry data fetched via useInquiries hook.",
  "frontend/src/pages/PackagesPage.tsx": "Travel packages listing page that displays all available packages in a grid with details (duration, highlights, price range in INR), featured badges, and inquiry buttons that navigate to contact page with pre-filled package parameter.",
  "frontend/src/utils/currency.ts": "Currency formatting utility functions that format numbers as Indian Rupees (INR) and create price range strings using Intl.NumberFormat with en-IN locale.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Playfair Display), container settings, box shadows, and animation keyframes for accordion components.",
  "project_state.json": "Project state metadata documenting the Leisureflies Travels luxury travel website architecture, completed features (chat widget, SEO optimization, INR pricing, company details), image requirements for destinations, and known architectural notes about the lead generation structure."
}